#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_container_app: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYzA5N2FkYS0yOTQyLTQwMjItYTEzNy1lN2JhYmQ3N2I4Yzc7b2JqZWN0SWQ9ZjgxYjViOTYtZjEwZS00NjdkLWJhMGMtNDE5NmZkMWEzMWY4O3N1YnNjcmlwdGlvbklkPWU4MmM1MjY3LTlkYzQtNGY0NS1hYzEzLWFiZGQ1ZTEzMGQyNzt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ghr-prd-uai001][0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Insights/components/ghr-prd-appi001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ContainerAppSubnet][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Insights/components/ghr-prd-appi001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Insights/components/ghr-prd-appi001|logAnalytics][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001/providers/Microsoft.Authorization/roleAssignments/f22f336e-4b23-40e0-24cc-5a2f87fa8451][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001/providers/Microsoft.Authorization/roleAssignments/d262e80f-e9e3-6769-2307-d9752fcff7b2][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001|logAnalytics][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/CAPrivateEndpointSubnet][0m
[0m[1mazapi_resource.container_apps_environment: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.App/managedEnvironments/ghr-prd-cae001][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.Network/privateEndpoints/ghr-prd-kv001-pe][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_github_pat: Refreshing state... [id=https://ghr-prd-kv001.vault.azure.net/secrets/github-pat/6bfcf6a404ac4229979a7651aa53fe29][0m
[0m[1mazapi_resource.container_apps_job: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.App/jobs/ghr-prd-caj001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001"
    }

[1m  # azapi_resource.container_apps_job[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "container_apps_job" {
      [33m~[0m[0m body                      = (sensitive value)
        id                        = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.App/jobs/ghr-prd-caj001"
        name                      = "ghr-prd-caj001"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
        tags                      = {
            "workload" = "github-runners"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001"
        name                            = "ghr-prd-kv001"
      [33m~[0m[0m public_network_access_enabled   = true [33m->[0m[0m false
        tags                            = {
            "workload" = "github-runners"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [33m~[0m[0m default_action             = "Allow" [33m->[0m[0m "Deny"
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
        id                             = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ghr-prd-container-rg/providers/Microsoft.KeyVault/vaults/ghr-prd-kv001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 3 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>